rickqi/esp32-ai/firmware/esp32_llm_v5_idf/sdkconfig.defaults
# esp32_llm_v5_idf — sdkconfig defaults (ESP32-S3)
CONFIG_IDF_TARGET="esp32s3"

# Flash/PSRAM (16MB flash, 8MB PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU: 240MHz (IDF 默认 160MHz — 推理性能关键 1.5x)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# App (factory partition)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/partitions.csv"

# Main task stack: llm_engine_generate uses out[2048] + hist[256] (~3.5KB+)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# PSRAM for LLM KV cache + scratch (esp32-ai model)
CONFIG_SPIRAM_USE_MALLOC=y

# === BLE HID Host (Bluetooth keyboard input) ===
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_BONDING=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE=0

# Serial console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Reduce log noise
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# === FATFS: 长文件名 (term_overlay.bin 13字符超 8.3) + 多 fd (ragsd 3 + XFER) ===
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFILES=8

# LLM inference is CPU-bound in main task (flash mmap + PSRAM, no yield per token)
# — disable task WDT to avoid false IDLE0 starvation panics
CONFIG_ESP_TASK_WDT_EN=n

# Optimization: -Os (matches xiaozhi; -Og ICEs xtensa gcc 14.2.0 on esp_lcd)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
